<?php

namespace App\Constants;

class DurationConstant
{
    public const DURATION_MONTHS = [
        0 => 'месяцев',
        1 => 'месяц',
        2 => 'месяца',
        3 => 'месяца',
        4 => 'месяца',
        5 => 'месяцев',
        6 => 'месяцев',
        7 => 'месяцев',
        8 => 'месяцев',
        9 => 'месяцев',
        10 => 'месяцев',
        11 => 'месяцев',
        12 => 'месяцев',
    ];

    public const DURATION_DAYS = [
        0 => 'дней',
        1 => 'день',
        2 => 'дня',
        3 => 'дня',
        4 => 'дня',
        5 => 'дней',
        6 => 'дней',
        7 => 'дней',
        8 => 'дней',
        9 => 'дней',
        10 => 'дней',
        11 => 'дней',
        12 => 'дней',
        13 => 'дней',
        14 => 'дней',
        15 => 'дней',
        16 => 'дней',
        17 => 'дней',
        18 => 'дней',
        19 => 'дней',
        20 => 'дней',
        21 => 'день',
        22 => 'дня',
        23 => 'дня',
        24 => 'дня',
        25 => 'дней',
        26 => 'дней',
        27 => 'дней',
        28 => 'дней',
        29 => 'дней',
        30 => 'дней',
        31 => 'день',
    ];
}
